; domain
;; ============================================================
;; DOMAIN: rover-mineral-transport
;; ------------------------------------------------------------
;; Autor: Equipo Actividad 3 — Razonamiento y planificacion automatica
;; Curso: Maestria, Primer Semestre
;; Fecha: 2026-05-11
;;
;; Descripcion: Modelo de planificacion clasica para un robot tipo
;;   rover que debe trasladar minerales desde localidades de origen
;;   hasta uno o mas laboratorios para su analisis.
;;
;; Decisiones de modelado (ver docs/01-pddl-modeling-decisions.md):
;;   ADR-001: capacidad del rover = 1 mineral a la vez (forzamos
;;            replanificacion y planes mas ricos que carga ilimitada).
;;   ADR-002: funcion de costo = unitaria por accion (total-cost).
;;            Compatible con planners optimal track del IPC2018.
;;   ADR-003: aristas dirigidas representadas con predicado
;;            (path ?from ?to). Para bidireccionales se declaran
;;            dos atomos (uno por sentido) en el problem.pddl.
;;   ADR-004: "mal tiempo" no se modela como literal — el enunciado
;;            lo usa como motivo narrativo de por que el rover no
;;            puede trasladar todos los minerales de una vez; ya
;;            queda capturado por la capacidad = 1.
;; ============================================================

(define (domain rover-mineral-transport)

  (:requirements
    :typing
    :action-costs)

  ;; -------- Tipos --------
  (:types
    location  ;; nodos del grafo (L1, L2, ...)
    mineral   ;; rocas que el rover debe transportar
    rover     ;; el robot que se mueve
  )

  ;; -------- Predicados --------
  (:predicates
    ;; Posicion del rover
    (at ?r - rover ?l - location)

    ;; Conectividad del grafo (arista dirigida)
    (path ?from - location ?to - location)

    ;; Estado de los minerales
    (mineral-at ?m - mineral ?l - location)
    (carrying  ?r - rover    ?m - mineral)
    (analyzed  ?m - mineral)

    ;; Capacidad del rover (ADR-001): exclusion mutua "free / carrying"
    (free ?r - rover)

    ;; Marca de laboratorio (puede haber 1 o N en distintos problems)
    (lab-at ?l - location)
  )

  ;; -------- Funciones --------
  (:functions
    (total-cost) - number
  )

  ;; ============================================================
  ;; Acciones
  ;; ============================================================

  ;; Mover el rover por una arista existente del grafo.
  (:action move
    :parameters (?r - rover ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (path ?from ?to)
    )
    :effect (and
      (not (at ?r ?from))
      (at ?r ?to)
      (increase (total-cost) 1)
    )
  )

  ;; Recoger un mineral en la localidad actual.
  ;; Solo posible si el rover esta libre (capacidad = 1).
  (:action pickup
    :parameters (?r - rover ?m - mineral ?l - location)
    :precondition (and
      (at ?r ?l)
      (mineral-at ?m ?l)
      (free ?r)
    )
    :effect (and
      (carrying ?r ?m)
      (not (mineral-at ?m ?l))
      (not (free ?r))
      (increase (total-cost) 1)
    )
  )

  ;; Entregar el mineral en un laboratorio.
  ;; Tras la entrega, el mineral queda analizado y el rover libre.
  (:action deliver
    :parameters (?r - rover ?m - mineral ?l - location)
    :precondition (and
      (at ?r ?l)
      (lab-at ?l)
      (carrying ?r ?m)
    )
    :effect (and
      (analyzed ?m)
      (not (carrying ?r ?m))
      (free ?r)
      (increase (total-cost) 1)
    )
  )

)

; problem
;; ============================================================
;; PROBLEM 2: "Tres minerales con acceso condicionado por el laboratorio"
;; ------------------------------------------------------------
;; Autor: Adonai Samael Hernandez Mata
;; Programa: Maestria en Inteligencia Artificial - UNIR
;; Curso: Razonamiento y planificacion automatica
;; Fecha: 2026-05-12
;;
;; ============================================================
;; MOTIVACION DEL ESCENARIO (design rationale)
;; ------------------------------------------------------------
;; Tomando el escenario base como punto de partida, este problema
;; introduce dos cambios que aumentan la complejidad del modelado:
;;
;;   1. SE ANADE UN TERCER MINERAL (M3) en una localidad nueva (L6).
;;      Esto fuerza al rover a realizar tres viajes al laboratorio
;;      (en vez de dos), demostrando que el modelado escala a un
;;      numero arbitrario de minerales sin redefinir el dominio.
;;
;;   2. SE ANADE UNA ARISTA UNIDIRECCIONAL (L5 -> L6) que obliga a
;;      pasar por el laboratorio antes de poder recoger M3. Esta
;;      restriccion examina si el planner puede razonar sobre
;;      precondiciones de localizacion no-triviales: el rover NO
;;      puede acceder a L6 directamente; debe haber visitado L5 al
;;      menos una vez para llegar.
;;
;;      Adicionalmente se anade una arista bidireccional L4 <-> L6
;;      como camino de regreso, evitando deadlock.
;;
;; HIPOTESIS QUE PRUEBA:
;;   El planner optimal track del IPC2018 (Delfi 1) debe encontrar
;;   un plan que aproveche el viaje natural del rover al laboratorio
;;   (entrega del primer mineral) para encadenar la recoleccion de M3
;;   sin retrocesos innecesarios. Plan optimo: 19 acciones (vs 14 del base).
;;
;; QUE DEMUESTRA DEL MODELADO PDDL:
;;   - Reusabilidad del dominio: el mismo `domain.pddl` sirve para
;;     instancias con N minerales sin modificacion alguna.
;;   - Expresividad de aristas dirigidas: el predicado `(path ?f ?t)`
;;     captura naturalmente restricciones topologicas complejas.
;;   - Importancia de la capacidad = 1 (ADR-001): obliga al planner
;;     a planificar visitas multiples al laboratorio, lo cual es
;;     mas rico que un escenario con capacidad ilimitada.
;;
;; TOPOLOGIA:
;;
;;          L1 <----> L3 ----> L2
;;                    |         |
;;                    v         v
;;                   L4 <-------+
;;                   /| \
;;                  / |  \   (L4 <-> L5 y L4 <-> L6 bidir)
;;                 /  |   \
;;                v   v    \
;;               L5 ----> L6   (L5 -> L6 unidir)
;;               (lab)
;;
;; ARISTAS:
;;   L1 <-> L3       bidireccional
;;   L3  -> L2       unidireccional
;;   L2  -> L4       unidireccional
;;   L3 <-> L4       bidireccional
;;   L4 <-> L5       bidireccional
;;   L4 <-> L6       bidireccional (camino de regreso desde L6)
;;   L5  -> L6       unidireccional (restriccion del escenario)
;; ============================================================

(define (problem rover-problem-2)
  (:domain rover-mineral-transport)

  (:objects
    L1 L2 L3 L4 L5 L6 - location
    M1 M2 M3          - mineral
    R1                - rover
  )

  (:init
    ;; Estado inicial: rover en L4, libre
    (at R1 L4)
    (free R1)

    ;; Distribucion de minerales
    (mineral-at M1 L1)
    (mineral-at M2 L2)
    (mineral-at M3 L6)

    ;; Laboratorio unico
    (lab-at L5)

    ;; Topologia del grafo
    ;; L1 <-> L3 (bidir)
    (path L1 L3)
    (path L3 L1)

    ;; L3 -> L2 (unidir — heredada del base)
    (path L3 L2)

    ;; L2 -> L4 (unidir — heredada del base)
    (path L2 L4)

    ;; L3 <-> L4 (bidir — heredada del base)
    (path L3 L4)
    (path L4 L3)

    ;; L4 <-> L5 (bidir — heredada del base)
    (path L4 L5)
    (path L5 L4)

    ;; L4 <-> L6 (bidir — camino de retorno desde L6)
    (path L4 L6)
    (path L6 L4)

    ;; L5 -> L6 (unidir — restriccion del escenario)
    (path L5 L6)

    ;; Funcion de costo
    (= (total-cost) 0)
  )

  (:goal (and
    (analyzed M1)
    (analyzed M2)
    (analyzed M3)
  ))

  (:metric minimize (total-cost))
)

; plan
1. (move r1 l4 l3)
   deleted: (at r1 l4)
   added: (at r1 l3)
   goals met: 0 of 3
2. (move r1 l3 l1)
   deleted: (at r1 l3)
   added: (at r1 l1)
   goals met: 0 of 3
3. (pickup r1 m1 l1)
   deleted: (mineral-at m1 l1) (free r1)
   added: (carrying r1 m1)
   goals met: 0 of 3
4. (move r1 l1 l3)
   deleted: (at r1 l1)
   added: (at r1 l3)
   goals met: 0 of 3
5. (move r1 l3 l4)
   deleted: (at r1 l3)
   added: (at r1 l4)
   goals met: 0 of 3
6. (move r1 l4 l5)
   deleted: (at r1 l4)
   added: (at r1 l5)
   goals met: 0 of 3
7. (deliver r1 m1 l5)
   deleted: (carrying r1 m1)
   added: (analyzed m1) (free r1)
   goals met: 1 of 3
8. (move r1 l5 l6)
   deleted: (at r1 l5)
   added: (at r1 l6)
   goals met: 1 of 3
9. (pickup r1 m3 l6)
   deleted: (mineral-at m3 l6) (free r1)
   added: (carrying r1 m3)
   goals met: 1 of 3
10. (move r1 l6 l4)
   deleted: (at r1 l6)
   added: (at r1 l4)
   goals met: 1 of 3
11. (move r1 l4 l5)
   deleted: (at r1 l4)
   added: (at r1 l5)
   goals met: 1 of 3
12. (deliver r1 m3 l5)
   deleted: (carrying r1 m3)
   added: (analyzed m3) (free r1)
   goals met: 2 of 3
13. (move r1 l5 l4)
   deleted: (at r1 l5)
   added: (at r1 l4)
   goals met: 2 of 3
14. (move r1 l4 l3)
   deleted: (at r1 l4)
   added: (at r1 l3)
   goals met: 2 of 3
15. (move r1 l3 l2)
   deleted: (at r1 l3)
   added: (at r1 l2)
   goals met: 2 of 3
16. (pickup r1 m2 l2)
   deleted: (mineral-at m2 l2) (free r1)
   added: (carrying r1 m2)
   goals met: 2 of 3
17. (move r1 l2 l4)
   deleted: (at r1 l2)
   added: (at r1 l4)
   goals met: 2 of 3
18. (move r1 l4 l5)
   deleted: (at r1 l4)
   added: (at r1 l5)
   goals met: 2 of 3
19. (deliver r1 m2 l5)
   deleted: (carrying r1 m2)
   added: (analyzed m2) (free r1)
   goals met: 3 of 3
